<template>
    <div class="access-spinner">
        <pre class="access-spinner__text">
          <!-- Text related to the spinner -->
        </pre>
    </div>
</template>
<script>
export default {
    mounted() {
        const textArray = textString.split("");
        const textElem = document.querySelector(".access-spinner__text");
        let count = 0;
        setInterval(() => {
            if (textArray[count] === "\n") {
                textElem.innerHTML += "<br>";
            } else {
                textElem.innerHTML += `<span class="access-spinner__character">${textArray[count]}</span>`;
            }
            count++;
            if (count === textArray.length) {
                count = 0;
            }
        }, 20);
        setTimeout(() => {
            this.$router.push({ name: "home" }); // Navigate to home page
        }, 22000);
    },
};
const textString = `.
    ServerRunning ...
        198.51.100.247
            Sever_Running...

                    {
                        IP:             21.253.258.2589
                        Port:           4769.55.3.9
                        Server:         @SVJ12711/LLCJ
                        Status:         @ LOADING ...
                        Strenght:       420 TB/s
                        Latency:        215 Bits
                        Timer:          20.75 sec
                    }

        Madeira, Manchester, Madrid, Turin
        ............................................
            & Manchester Again,
            ............................................
                 Wreathed In RED
                 ............................................
                    Restored to this great gallery of the game
                    ............................................
                        a walking work of art, 
                        ............................................
                            Vintage Beyond Valuation
                            ............................................
                        Beyond Vorgery or Imitation, 18 Years since
                        ............................................
                    since that trembling teenager or touch and tease
                    ............................................
                first tip toed onto this storied stage
                ......................................
            now in his emaculate maturity 
            .............................
        CR7 REUNITED
        ....................

        
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣶⣾⣿⣿⣿⣿⣶⣷⣶⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣼⣿⣿⣿⣿⣿⣿⣿⣽⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⡿⠻⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⣿⣯⣻⣧⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⠟⠉⠁⠀⠀⠀⠀⠀⠀⠀⠉⠀⠉⠉⠙⠛⠿⣿⣿⣿⣿⢽⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣷⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣿⣵⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣽⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠚⢻⣿⣿⣿⡏⠀⣠⡶⠒⢾⣾⣷⣶⣤⣄⠀⠀⠀⠀⢀⣤⣤⣤⣤⣤⣤⣄⠀⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣧⡾⠁⢀⣤⣶⡶⣾⣿⣿⣷⠀⠀⠀⠀⣸⣿⣿⣿⣭⣀⡀⠙⢳⣬⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣧⠀⠾⣿⠉⠉⠉⠙⠛⠉⠀⠀⠀⠀⠉⠹⠋⠻⠿⠻⢿⣆⠰⣿⣋⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠘⢹⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡄⢹⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢿⡿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⣶⡤⠿⣷⣶⠷⣦⣦⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣥⣼⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣾⠁⢿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠁⠀⠀⠀⠙⠁⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⡿⢻⢻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣆⣴⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⣤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⡃⢨⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⡟⢻⣿⣏⠀⠀⠀⠀⠀⠀⠀⠦⠾⠛⠉⠉⠉⠉⠉⠳⣶⡄⠀⠀⠀⠀⠀⠀⣿⡷⢾⡞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⢹⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠲⣶⣶⣶⣶⡶⠈⠀⠀⠀⠀⠀⠀⠀⣿⠷⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡄⣺⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣶⣄⢲⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣾⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣶⣄⡀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣶⣶⣾⣷⣿⣿⣿⣿⣿⣿⣿⡿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠁⠀⠈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠋⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠈⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠘⣿⣄⡀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡏⠀⠀⠀⠀⠀⠀⠈⠿⣿⣷⣄⣀⣠⠾⠋⠀⠀⠀⠀⠀⠀⠀⢰⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣾⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⠿⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠖⠉⢿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⡟⠈⠓⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⢟⣵⠆⠀⠈⠻⣿⣷⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⡿⠟⠁⠀⢶⣄⠙⠲⣤⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢀⣤⢞⣡⡾⠛⠁⠀⠀⠀⠀⠈⠙⠻⣿⣿⣶⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⡴⠟⠛⠁⠀⠀⠀⠀⠀⠈⠻⢦⣄⠉⠓⢤⣄⡀⠀⠀
⠀⠀⣠⡤⣞⣭⡾⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⠿⠷⠤⠤⠤⠤⠤⠶⠖⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⢦⣄⠀⠙⠲⢦
⢐⣫⣡⡾⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠻⢶⣄⣼
⠛⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠋


⢠⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣴⡄
⢸⣿⣿⣿⠛⠛⣿⣿⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⣿⣿⣿⠿⠛⠛⠛⠿⣿⣿⠛⠛⠛⠛⠛⠛⢻⣿⠻⣿⣿⣿⣿⡟⠛⢻⣿⠛⠛⠛⠛⠛⠿⣿⣿⣿⣿⡇
⢸⣿⣿⣿⠀⠀⣿⣿⣿⣿⣿⣿⠀⢰⣶⣶⣶⣶⣿⡟⠁⢀⣴⣶⣤⣤⣾⣿⠀⠀⣶⣶⣶⣶⣾⣿⠂⠈⠻⣿⣿⡇⠀⢸⣿⠀⠀⣶⣶⣤⡀⠈⢿⣿⣿⡇
⠨⣿⣿⣿⠀⠀⣿⣿⣿⣿⣿⣿⠀⠈⠉⠉⢉⣿⣿⠁⠀⣿⣿⣿⠉⠉⢹⣿⠀⠀⠉⠉⠉⣹⣿⣿⠀⢸⣦⠈⠻⣧⠀⢸⣿⠀⠀⣿⣿⣿⣿⠀⢸⣿⣿⡇
⠀⣿⣿⣿⠀⠀⣿⣿⣿⣿⣿⣷⠀⢸⣿⣿⣿⣿⣿⣇⠀⠻⢿⣿⠿⠀⢸⣿⠀⠀⣿⣿⣿⣿⣿⣿⠀⢸⣿⣷⣄⡀⠀⢸⣿⠀⠀⣿⣿⡿⠃⠀⣼⣿⣿⡇
⢀⣿⣿⣿⣀⣀⣀⣀⣀⣀⣼⣯⣀⣀⣀⣀⣀⣀⣿⣿⣷⣄⣀⣀⣀⣤⣾⣿⣀⣀⣀⣀⣀⣀⣸⣿⣀⣸⣿⣿⣿⣿⣦⣸⣿⣄⣀⣀⣀⣀⣠⣾⣿⣿⣿⡇


Server Has Been Located :
    Server is located at IP Address: 159.753.21.29
        Server being Hacked:
            Server ONLINE:
                    RUNNING:
                            {
                                IP:         127.0.0.155.66
                                Port:       8439
                                Server:     21.55.LV2
                                Location:   Plumstead / Southfield
                                Status:     Online
                                PIN:        258 369 25-9
                                OTP:        3-13-14
                                Nommer:     28
                            }

  "LIGMA AGENCY // local / scanning...",
    "IP ADDRESS: 127.366.321.22
        "scanning ports...",

            "UR BACKDOOR FOUND (IM GETTIN HARD)",
                "ENTERING UR BACKDOOR (AHHHHHHHHHHHHHHHHH)",
                    "BACKDOOR VIOLENTLY USED (TRUST ME ZADDY)",
 
  "WAGWAN.EXE  RTY.909/55/8",
    "...locating vulnerabilities...",
        "...NO vulnerabilities found...",
            "DEPLOY SERVER TO HANOVER PARK CLINIC",


    "SCAN: ____________ 0187.0550.0554.0080",  
        "SCAN: ____________ 0187.0550.0554.0080",  
            "SCAN: ____________ 0187.0550.0554.0080",  
                "SCAN: ____________ 0100.1100.0554.0080",
                    "SCAN: ____________ 0020.4580.0553.0080",
                        "SCAN: ____________ 0001.1258.0554.0550",
                            "SCAN: "21 CAN U DO SUM FOR ME" >>>>>>
                        "SCAN: ____________ 0012.1245.0553.0030",
                     "SCAN: ____________ 0100.9854.0554.0080",
                "SCAN: ____________ 0020.0018.0553.0080",
            "SCAN: ____________ 0100.2010.0554.0080",
        "SCAN: ____________ 0187.0550.0554.0080", 
    "SCAN: ____________ 0187.0550.0554.0080",  
 

________________________________________________________

  Currently Runnin the block ...
    Securing the load ...
        Holy Shit is that a Skyline ........
           
                     \______________________/
                      __/__|_________|__\__
                    /⭕⭕____________⭕⭕\
                    |_____/__GTR-R34__\_____|
                    \💥💥|_|_|_|_|_|_|💥💥/

            || STUTUTUTUTUTUTUTUTUTUTUTUTUTUTUTUTUU ||
    
__________________________________________________________

    Final Stage of activation:
    {
        IP:          HACK SUCCESSFULL ...
        SCAN:        ACCCESS GRANTED ...
        SERVER:      ACCCESS GRANTED ...
        PORT:        ACCCESS GRANTED ...
        SIGNAL:      ACCCESS GRANTED ...
        VPN:         DISCONNECTING ...
        FIREWALL:    SHUTTING DOWN ...
        SECURITY:    FORTIFING ...
        ADDRESS:     LOCATED ...
        DEVICE:      LAPTOP / PC ...
        SOFTWARE:    IDENTIFIED ...
        USERNAME:    N/A ...
        PASSWORD:    N/A ...
        EMAIL:       N/A ...
        OTP:         2121-XXXX-XXXX-5555 ...
    }
    !!!! Activation Complete !!!!

    SUCCESSFULLY GRANTED PERMISSION TO LIGMA AGENCY
    ....
        WE'VE LOCATED YOUR IP AND HAVE GRANTED PERMISSION
        ....
            FULL CONFIDENSIALLITY WILL BE KEPT SO WE EXPECT THE SAME
            ....
                THIS HACK WILL BE DEACTIVATED SHORTLY
                ....
                    THANK YOU FOR UR PAITIENTS
                ....
                WE CLEANING THE FLOOR GOU NOW
            ....
            WE CLOSING THE INCOGNITO TABS
        ....
        WE EATING A GATSBY ALSO 
    ....
    ANYWAY WELCOME TO LIGMA AGENCY
        `;
</script>
<style scoped>
html,
body {
    height: 100%;
    margin: 0;
    padding: 0;
}

.access-spinner {
    background: #000;
    height: 100vh;
}

.access-spinner__text {
    bottom: 0;
    font-family: monospace;
    font-size: 18px;
    left: 0;
    line-height: 1.5rem;
    padding: 2rem;
    position: absolute;
    right: 0;
    text-align: left;
    color: #ff003c;
}

.access-spinner__character {
    animation: type 500ms linear;
    color: #ff003c;
}

@keyframes type {
    0% {
        background: #ddd;
        color: #ddd;
    }

    5% {
        background: transparent;
        color: #ddd;
    }

    100% {
        background: transparent;
        color: #ff003c;
    }
}
</style>